k6_test.txt
bennylee@Bennys-MBP-2:~/Documents/galvanize/Calendar$ k6 run k6_test.js          /\      |‾‾|  /‾‾/  /‾/
     /\  /  \     |  |_/  /  / /
    /  \/    \    |      |  /  ‾‾\
   /          \   |  |‾\  \ | (_) |
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     script: k6_test.js
     output: -

  scenarios: (100.00%) 1 executors, 2000 max VUs, 1m0s max duration (incl. graceful stop):
           * default: Up to 2000 looping VUs for 30s over 1 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m39.1s), 0000/2000 VUs, 20283 complete and 0 interrupted iterations
default ✓ [======================================] 0000/2000 VUs  30s


    data_received..............: 5.2 MB 133 kB/s
    data_sent..................: 1.9 MB 48 kB/s
    http_req_blocked...........: avg=66.06µs  min=1µs   med=3µs     max=16.12ms p(90)=211.19µs p(95)=328µs
    http_req_connecting........: avg=38.37µs  min=0s    med=0s      max=15.94ms p(90)=0s       p(95)=210µs
    http_req_duration..........: avg=672.13ms min=533µs med=10.39ms max=8.16s   p(90)=1.67s    p(95)=6.4s
    http_req_receiving.........: avg=107.04µs min=15µs  med=36µs    max=16.18ms p(90)=144µs    p(95)=217µs
    http_req_sending...........: avg=76.95µs  min=6µs   med=14µs    max=37.47ms p(90)=51µs     p(95)=77µs
    http_req_tls_handshaking...: avg=0s       min=0s    med=0s      max=0s      p(90)=0s       p(95)=0s
    http_req_waiting...........: avg=671.94ms min=497µs med=10.34ms max=8.16s   p(90)=1.67s    p(95)=6.4s
    http_reqs..................: 20283  518.234626/s
    iteration_duration.........: avg=2s       min=1s    med=1.01s   max=16.19s  p(90)=5.25s    p(95)=7.95s
    iterations.................: 20283  518.234626/s
    vus........................: 410    min=64   max=1999
    vus_max....................: 2000   min=2000 max=2000